000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <comment>Организации</comment>
  <attributes>
    <name>Блокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетДенежныхСредствПоОбособленнымПодразделениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоЕДРПОУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСокращенное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НалоговаяИнспекция</name>
    <comment>Налоговая инспекция</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособОценкиТоваровВРознице</name>
    <type>
      <types>EnumRef.СпособыОценкиТоваровВРознице</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КодыВидовОплат</name>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>EnumRef.ВидыОплатЭККР</types>
      </type>
    </attributes>
    <attributes>
      <name>Код</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/СистемыНалогообложенияОрганизаций/СистемыНалогообложенияОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СистемыНалогообложенияОрганизаций</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>СистемаНалогообложения</name>
    <type>
      <types>EnumRef.СистемыНалогообложения</types>
    </type>
  </resources>
  <resources>
    <name>ИННПлательщикаНДС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерСвидетельстваПлательщикаНДС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнформацияОСтатусеПлательщикаНалогов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РазрешитьПродажуПодарочныхСертификатов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьОплатуПодарочнымиСертификатами</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОрганизацииПодразделений/ОрганизацииПодразделений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОрганизацииПодразделений</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Владелец</name>
    <comment>Элемент справочника, периодичность реквизита которого мы обеспечиваем.</comment>
    <type>
      <types>String</types>
      <types>CatalogRef.Магазины</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СистемыНалогообложения/СистемыНалогообложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СистемыНалогообложения</name>
  <enumValues>
    <name>НалогНаПрибыль</name>
  </enumValues>
  <enumValues>
    <name>НалогНаПрибыльИНДС</name>
  </enumValues>
  <enumValues>
    <name>ЕдиныйНалог</name>
  </enumValues>
  <enumValues>
    <name>ЕдиныйНалогИНДС</name>
  </enumValues>
  <enumValues>
    <name>Неплательщик</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Магазины/Магазины.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Магазины</name>
  <attributes>
    <name>Блокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВведенВЭксплуатацию</name>
    <comment>Магазин переведен в режим работы 1С:Розница</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельности</name>
    <type>
      <types>CatalogRef.ВидыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМинимальныхЦенПродажи</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>CatalogRef.Города</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПользователей</name>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФизЛиц</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРаботы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПеремещении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПоступлении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПрименениеЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПрямуюИнкассацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаМагазина</name>
    <comment>Основная денежная касса магазина</comment>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>КодБюджета</name>
    <type>
      <types>CatalogRef.КодыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>КодФилиала</name>
    <comment>Navision</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьАссортимент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерМагазина</name>
    <comment>Используется для начальной загрузки из MForce</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделениеОрганизации</name>
    <comment>Определяет филиал</comment>
    <type>
      <types>CatalogRef.ОбособленныеПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтменаРучныхСкидок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерсональныеПродажи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подпись</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОкругленияСуммыЧекаВПользуПокупателя</name>
    <type>
      <types>EnumRef.ПорядкиОкругления</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоЦенообразования</name>
    <type>
      <types>CatalogRef.ПравилаЦенообразования</types>
    </type>
  </attributes>
  <attributes>
    <name>СегментИсключаемойНоменклатуры</name>
    <type>
      <types>CatalogRef.СегментыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПереброски</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПоступления</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПродажи</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладСвязи</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладУправляющейСистемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматМагазина</name>
    <type>
      <types>CatalogRef.ФорматыМагазинов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Организации/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
 
// Функция определяет значения реквизитов выбранной организации.
//
// Параметры:
//  Организация - СправочникСсылка.Организации - Ссылка на организацию
//
// Возвращаемое значение:
//	Структура - реквизиты выбранной организации
//
Функция РеквизитыОрганизации(Организация, ДатаСреза = '00010101')	Экспорт

	Если НЕ ПривилегированныйРежим() Тогда	//	LNK 08.04.2024 08:19:20

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Организация,
	|	Организации.Наименование КАК Наименование,
	|	Организации.Наименование КАК Представление,
	|	ВЫРАЗИТЬ(Организации.НаименованиеСокращенное КАК СТРОКА(1000)) КАК НаименованиеСокращенное,
	|	ВЫРАЗИТЬ(Организации.НаименованиеПолное КАК СТРОКА(1000)) КАК НаименованиеПолное,
	|	Организации.ЮрФизЛицо КАК ЮрФизЛицо,
	|	Организации.КодПоЕДРПОУ КАК КодПоЕДРПОУ,
	|	Организации.Блокирован КАК Блокирован
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка = &Организация"
	);
	Запрос.УстановитьПараметр("Организация"	, Организация);
	Запрос.УстановитьПараметр("ДатаСреза"	, КонецДня(?(ДатаСреза = '00010101' ИЛИ ДатаСреза = Неопределено, ТекущаяДатаСеанса(), ДатаСреза)));

	РезультатЗапроса = Запрос.Выполнить();
	Выборка			 = РезультатЗапроса.Выбрать();
	Выборка.Следующий();

	СоставРеквизитов = ОбщегоНазначенияРТ.СоздатьСтруктуруПоСтрокеВыборки(РезультатЗапроса, Выборка, Истина);

	//СоставРеквизитов = Новый Структура("Представление, Наименование, НаименованиеПолное, ЮрФизЛицо",
	//	Представление,
	//	Наименование,
	//	НаименованиеПолное,
	//	ЮрФизЛицо
	//);

	Возврат СоставРеквизитов;

КонецФункции

// Функция определяет являеться ли организация плательщиком налога на добавленную стоимость.
//
// Параметры:
//	Организация - СправочникСсылка.Организации - Организация, для которой определяется, являеться ли она плательщиком НДС
//	Дата - Дата определения системы налогообложения
//
// Возвращаемое значение:
//	Булево
//
Функция ПлательщикНДСУкр(Организация, Дата) Экспорт
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ИСТИНА КАК Плательщик
	|ИЗ
	|	РегистрСведений.СистемыНалогообложенияОрганизаций.СрезПоследних(&Дата, Организация = &Организация) КАК Налогообложение
	|ГДЕ
	|	Налогообложение.СистемаНалогообложения В (ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.НалогНаПрибыльИНДС), ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.ЕдиныйНалогИНДС))"
	);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	ПлательщикНДС = Ложь;

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда

		ПлательщикНДС = Выборка.Плательщик;

	КонецЕсли;

	Возврат ПлательщикНДС;

КонецФункции

// Получает организацию, указанную основной в учётной политике.
//
// Возвращаемое значение:
// СправочникСсылка.Организации - Найденная организация
// Неопределено - если организаций нет или организаций больше одной
//
Функция ПолучитьОрганизациюПоУмолчанию() Экспорт
	
	Возврат ОбщегоНазначенияРТ.ПолучитьУчетнуюПолитику().ОсновнаяОрганизация;

КонецФункции

Функция ПолучитьОрганизацию(КодПоЕДРПОУилиИНН, ВернутьОсновнуюЕслиПусто = Ложь)	Экспорт	//	LNK 08.06.2021 11:27:53

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

	Организация = Справочники.Организации.ПустаяСсылка();

	Если ТипЗнч(КодПоЕДРПОУилиИНН) = Тип("Строка") И НЕ ПустаяСтрока(КодПоЕДРПОУилиИНН) Тогда

		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ТаблицаСправочник.Ссылка КАК Организация,
		|	ВЫБОР
		|		КОГДА ТаблицаСправочник.ПометкаУдаления
		|				ИЛИ ТаблицаСправочник.Блокирован
		|			ТОГДА 2
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КлючПорядка
		|ИЗ
		|	Справочник.Организации КАК ТаблицаСправочник
		|ГДЕ
		|	ТаблицаСправочник.КодПоЕДРПОУ = &КодПоЕДРПОУилиИНН
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ТаблицаСправочник.Ссылка,
		|	ВЫБОР
		|		КОГДА ТаблицаСправочник.ПометкаУдаления
		|				ИЛИ ТаблицаСправочник.Блокирован
		|			ТОГДА 2
		|		ИНАЧЕ 0
		|	КОНЕЦ + 1
		|ИЗ
		|	Справочник.Организации КАК ТаблицаСправочник
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СистемыНалогообложенияОрганизаций.СрезПоследних КАК ТаблицаНалогообложение
		|		ПО ТаблицаСправочник.Ссылка = ТаблицаНалогообложение.Организация
		|ГДЕ
		|	ТаблицаНалогообложение.ИННПлательщикаНДС = &КодПоЕДРПОУилиИНН
		|
		|УПОРЯДОЧИТЬ ПО
		|	КлючПорядка"
		);	//	"КлючПорядка" на всякий случай.. вдруг ссылок с ЕДРПОУ будет несколько?
		Запрос.УстановитьПараметр("КодПоЕДРПОУилиИНН", СокрЛП(КодПоЕДРПОУилиИНН));

		Результат = Запрос.Выполнить();

		Если НЕ Результат.Пустой() Тогда

			Выборка = Результат.Выбрать();
			Выборка.Следующий();

			Организация = Выборка.Организация;

		КонецЕсли;

	ИначеЕсли ВернутьОсновнуюЕслиПусто = Истина Тогда

		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	УчетнаяПолитика.ОсновнаяОрганизация КАК Организация
		|ИЗ
		|	РегистрСведений.УчетнаяПолитика.СрезПоследних КАК УчетнаяПолитика"
		);

		Результат = Запрос.Выполнить();

		Если НЕ Результат.Пустой() Тогда

			Выборка = Результат.Выбрать();
			Выборка.Следующий();

			Организация = Выборка.Организация;

		КонецЕсли;

	КонецЕсли;

	Возврат Организация;

КонецФункции

//Возвращает систему налогообложения организации
//Параметры: 
//Дата - Дата
//Организация - СправочникСсылка.Организации
//Возвращаемое значение:
//Структура с ключами:
//Дата - дата применения системы налогообложения
//СистемаНалогообложения - ПеречислениеСсылка.СистемыНалогообложения
Функция ПолучитьСистемуНалогообложения(Дата, Организация) Экспорт

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ТаблицаРегистра.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК Дата,
	|	ЕСТЬNULL(ТаблицаРегистра.СистемаНалогообложения, Ведущая.СистемаНалогообложения) КАК СистемаНалогообложения,
	|	ЕСТЬNULL(ТаблицаРегистра.ИННПлательщикаНДС, """") КАК ИННПлательщикаНДС,
	|	ЕСТЬNULL(ТаблицаРегистра.НомерСвидетельстваПлательщикаНДС, """") КАК НомерСвидетельстваПлательщикаНДС,
	|	ЕСТЬNULL(ТаблицаРегистра.ИнформацияОСтатусеПлательщикаНалогов, """") КАК ИнформацияОСтатусеПлательщикаНалогов,
	|	ЕСТЬNULL(ТаблицаРегистра.РазрешитьПродажуПодарочныхСертификатов, ЛОЖЬ) КАК РазрешитьПродажуПодарочныхСертификатов,
	|	ЕСТЬNULL(ТаблицаРегистра.РазрешитьОплатуПодарочнымиСертификатами, ЛОЖЬ) КАК РазрешитьОплатуПодарочнымиСертификатами
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.ПустаяСсылка) КАК СистемаНалогообложения) КАК Ведущая
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СистемыНалогообложенияОрганизаций.СрезПоследних(&Дата, Организация = &Организация) КАК ТаблицаРегистра
	|		ПО (ИСТИНА)"
	);
	
	Запрос.УстановитьПараметр("Дата", ?(Дата = Неопределено ИЛИ Дата = '00010101', ТекущаяДата(), Дата));
	Запрос.УстановитьПараметр("Организация", Организация);

	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	Выборка.Следующий();

	СоставРеквизитов = ОбщегоНазначенияРТ.СоздатьСтруктуруПоСтрокеВыборки(Результат, Выборка);

	Возврат СоставРеквизитов;

	//Если Выборка.Следующий() Тогда
	//	
	//	Возврат Новый Структура("Дата, СистемаНалогообложения", Выборка.Дата, Выборка.СистемаНалогообложения);
	//	
	//Иначе
	//	
	//	Возврат Новый Структура("Дата, СистемаНалогообложения", "00010101", Перечисления.СистемыНалогообложения.ПустаяСсылка()); 
	//	
	//КонецЕсли;
	
КонецФункции

//	LNK 03.04.2017 14:08:04
Функция ПолучитьКодыВидовОплат(Организация)	Экспорт

	УстановитьПривилегированныйРежим(Истина);

	СоответствиеВидовОплат = Новый Соответствие;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТабличнаяЧасть.ВидОплаты КАК ВидОплаты,
	|	ТабличнаяЧасть.Код КАК Код
	|ИЗ
	|	Справочник.Организации.КодыВидовОплат КАК ТабличнаяЧасть
	|ГДЕ
	|	ТабличнаяЧасть.Ссылка = &Организация
	|	И НЕ ТабличнаяЧасть.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыОплатЭККР.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код"
	);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СоответствиеВидовОплат.Вставить(Выборка.ВидОплаты, Выборка.Код);

	КонецЦикла;

//	Теперь проверим, чтобы все элементы были указаны!

	Для каждого Элемент Из Перечисления.ВидыОплатЭККР Цикл

		Если СоответствиеВидовОплат.Получить(Элемент) = Неопределено Тогда

			СоответствиеВидовОплат.Вставить(Элемент, Перечисления.ВидыОплатЭККР.Индекс(Элемент));

		КонецЕсли;

	КонецЦикла;
	
	Возврат СоответствиеВидовОплат;

КонецФункции // ПолучитьКодыВидовОплат()

Функция ПолучитьПараметры(Организация)	Экспорт


КонецФункции

//	LNK 24.10.2017 12:48:11
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)

	Если НЕ
	(ОбщегоНазначенияКлиентСервер.ЗначениеКлючаСтруктуры(Параметры, "ПоказатьВсеЭлементы", Ложь) ИЛИ ПараметрыСеанса.ДоступныВсеОрганизации)	Тогда
		
		СтандартнаяОбработка = Ложь;

		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ТаблицаОрганизаций.Организация КАК Организация,
		|	ТаблицаОрганизаций.Организация.Наименование КАК КлючПорядка
		|ИЗ
		|	Справочник.Магазины КАК Магазины
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОрганизацииПодразделений.СрезПоследних(&Период, ) КАК ТаблицаОрганизаций
		|		ПО Магазины.Ссылка = ТаблицаОрганизаций.Владелец
		|ГДЕ
		|	Магазины.ВведенВЭксплуатацию
		|	И НЕ(Магазины.Блокирован
		|				ИЛИ Магазины.ПометкаУдаления)
		|
		|УПОРЯДОЧИТЬ ПО
		|	КлючПорядка"
		);
		Запрос.УстановитьПараметр("Период", ТекущаяДата());

		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Организация"));

	КонецЕсли;

КонецПроцедуры

#КонецЕсли
